{"modelTopology": {"keras_version": "2.2.2", "training_config": {"metrics": ["categorical_accuracy"], "optimizer_config": {"class_name": "RMSprop", "config": {"decay": 0.0, "lr": 0.0010000000474974513, "epsilon": 1e-07, "rho": 0.8999999761581421}}, "loss": "categorical_crossentropy", "sample_weight_mode": null, "loss_weights": null}, "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": [{"class_name": "Bidirectional", "config": {"batch_input_shape": [null, 397, 2], "trainable": true, "layer": {"class_name": "LSTM", "config": {"units": 20, "dropout": 0.0, "recurrent_regularizer": null, "bias_regularizer": null, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "return_sequences": true, "stateful": false, "use_bias": true, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_regularizer": null, "name": "lstm_1", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_constraint": null, "unit_forget_bias": true, "trainable": true, "go_backwards": false, "unroll": false, "return_state": false, "activation": "tanh", "activity_regularizer": null, "implementation": 1}}, "name": "bidirectional_1", "merge_mode": "concat"}}, {"class_name": "Bidirectional", "config": {"trainable": true, "layer": {"class_name": "LSTM", "config": {"units": 20, "dropout": 0.0, "recurrent_regularizer": null, "bias_regularizer": null, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "return_sequences": false, "stateful": false, "use_bias": true, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_regularizer": null, "name": "lstm_2", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_constraint": null, "unit_forget_bias": true, "trainable": true, "go_backwards": false, "unroll": false, "return_state": false, "activation": "tanh", "activity_regularizer": null, "implementation": 1}}, "name": "bidirectional_2", "merge_mode": "concat"}}, {"class_name": "Dense", "config": {"units": 3, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_constraint": null, "name": "dense_1", "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "softmax"}}]}}, "weightsManifest": [{"weights": [{"shape": [2, 80], "name": "bidirectional_1/forward_lstm_1/kernel", "dtype": "float32"}, {"shape": [20, 80], "name": "bidirectional_1/forward_lstm_1/recurrent_kernel", "dtype": "float32"}, {"shape": [80], "name": "bidirectional_1/forward_lstm_1/bias", "dtype": "float32"}, {"shape": [2, 80], "name": "bidirectional_1/backward_lstm_1/kernel", "dtype": "float32"}, {"shape": [20, 80], "name": "bidirectional_1/backward_lstm_1/recurrent_kernel", "dtype": "float32"}, {"shape": [80], "name": "bidirectional_1/backward_lstm_1/bias", "dtype": "float32"}, {"shape": [40, 80], "name": "bidirectional_2/forward_lstm_2/kernel", "dtype": "float32"}, {"shape": [20, 80], "name": "bidirectional_2/forward_lstm_2/recurrent_kernel", "dtype": "float32"}, {"shape": [80], "name": "bidirectional_2/forward_lstm_2/bias", "dtype": "float32"}, {"shape": [40, 80], "name": "bidirectional_2/backward_lstm_2/kernel", "dtype": "float32"}, {"shape": [20, 80], "name": "bidirectional_2/backward_lstm_2/recurrent_kernel", "dtype": "float32"}, {"shape": [80], "name": "bidirectional_2/backward_lstm_2/bias", "dtype": "float32"}, {"shape": [40, 3], "name": "dense_1/kernel", "dtype": "float32"}, {"shape": [3], "name": "dense_1/bias", "dtype": "float32"}], "paths": ["group1-shard1of1"]}]}